Tekla Open API Reference for Tekla Structures 2025
Size.ToString Method (String)
 Returns a string that represents this instance (in fractional inches if advanced option XS_USE_ONLY_INCHES_IN_SHEET_SIZES set to true).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ToString(
	string separator
)
Public Function ToString (
	separator As String
) As String
Parameters
separator
Type: System.String
The separator characters(s).
Return Value
Type: String
 A string that represents this instance using the specified separator character(s).
Examples
 This example shows how to convert a Size instance into a string representation using a specific separator parameter. The result is affected by the value of the advanced option: XS_USE_ONLY_INCHES_IN_SHEET_SIZES. In order for this advanced option to work, set the advanced options XS_IMPERIAL and XS_IMPERIAL_INPUT to TRUE. If the advanced option XS_USE_ONLY_INCHES_IN_SHEET_SIZES is set to TRUE the result would display as: 17" by 10"1/2 but if set to FALSE it would display as: 431.8 by 266.7
using Tekla.Structures.Drawing;
public class Example
{
       public void Example1()
       {
           // For this demonstration, we'll format 431.8x266.7 millimeters.
           Size size = new Size(431.8, 266.7);
           string formattedString = size.ToString(" by ");
       }
}
See Also
Reference
Size Class
ToString Overload
Tekla.Structures.Drawing Namespace